# 6. Реализовать два небольших скрипта:
# а) итератор, генерирующий целые числа, начиная с указанного,
# б) итератор, повторяющий элементы некоторого списка, определенного заранее.
# Подсказка: использовать функцию count() и cycle() модуля itertools.
# Обратите внимание, что создаваемый цикл не должен быть бесконечным. Необходимо предусмотреть условие его завершения.
# Например, в первом задании выводим целые числа, начиная с 3, а при достижении числа 10 завершаем цикл.
# Во втором также необходимо предусмотреть условие, при котором повторение элементов списка будет прекращено.

from itertools import count, cycle


def get_iterator(n):
    for el in count(n):
        if el > 10:
            break

        print(el)


def get_cycle(t):
    c = 0
    for el in cycle(t):
        if c > 10:
            break

        print(el)
        c += 1


get_iterator(6)
get_cycle('xyz')
